uhnp/src/InformationRegisters/ЗначенияКотировокФИ/ЗначенияКотировокФИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияКотировокФИ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <attributes>
    <name>КолонкаКотировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидКотировки</name>
    <type>
      <types>DefinedType.ИсточникКотировки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыКотировокФинансовыхИнструментов/ТипыКотировокФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКотировокФинансовыхИнструментов</name>
  <enumValues>
    <name>КурсВалюты</name>
    <comment>Указывается валюта</comment>
  </enumValues>
  <enumValues>
    <name>РыночнаяСтавкаПроцента</name>
    <comment>указывается страна</comment>
  </enumValues>
  <enumValues>
    <name>БанковскаяКотировка</name>
    <comment>Указывается банк-контрагент</comment>
  </enumValues>
  <enumValues>
    <name>БанковскаяСтавкаПроцента</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКотировкаЦеннойБумаги</name>
  </enumValues>
  <enumValues>
    <name>КотировкаЦеннойБумаги</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ЗначенияКотировокФИ/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СинонимыПолей = Новый Структура("ВидКотировки", "Котировка");
	УправлениеФормойУХ.УстановитьПредставлениеОтбора(ЭтотОбъект,,,,,СинонимыПолей);
	
	Если Параметры.Отбор.Свойство("ВидКотировки") И ЗначениеЗаполнено(Параметры.Отбор.ВидКотировки) Тогда
		Элементы.ВидКотировки.Видимость = Ложь;
	КонецЕсли;
	
	УО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(УО.Поля, "Кратность");
	УО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	ТиповыеОтчетыУХ.ДобавитьОтбор(УО.Отбор, "ВидКотировки.ТипКотировки", 
		Перечисления.ТипыКотировокФинансовыхИнструментов.КурсВалюты, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗначенияКотировки(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТЧ = "РегистрСведений.ЗначенияКотировокФИ";
	ВидКотировки = ТекущаяСтрока.ВидКотировки;
	
	ДопПараметры = Новый Структура("ИмяОбъекта, ИмяТЧ, ИсточникКолонок",
									ИмяТЧ, ИмяТЧ, "НЗ");

	Отбор = Новый Структура("ВидКотировки", ВидКотировки);
	
	ОписаниеКоманды = Новый Структура("ДополнительныеПараметры", ДопПараметры);
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("ОписаниеКоманды",	ОписаниеКоманды);
	ПараметрыЗагрузки.Вставить("Форма",				ЭтотОбъект);
	ПараметрыЗагрузки.Вставить("Объект",			ВидКотировки);
	ПараметрыЗагрузки.Вставить("Отбор",				Отбор);
	ПараметрыЗагрузки.Вставить("ОтборыТипов",		ВстраиваниеУХКлиентСервер.ПустыеОтборыТипов());
	ПараметрыЗагрузки.Вставить("ПропуститьПроверкуЗагрузки",	Истина);
	
	МСФОКлиентУХ.ЗагрузкаДанных_Подключаемый(ВидКотировки, ПараметрыЗагрузки);

КонецПроцедуры

#КонецОбласти
